export interface EPDSQuestion {
  id: number;
  question: string;
  reverseScore: boolean;
  options: string[];
}

export const questions: EPDSQuestion[] = [
  {
    id: 1,
    question: "என்னால் வேடிக்கையான நிகழ்வுகளைக் கண்டு சிரிக்க முடிந்தது:",
    reverseScore: true,
    options: [
      "எப்போதும் என்னால் செய்ய முடிந்த அளவுக்கு",
      "தற்போது அந்த அளவுக்கு அல்ல",
      "தற்போது கண்டிப்பாக அந்த அளவுக்கு அல்ல",
      "எப்போதுமே அல்ல"
    ]
  },

  {
    id: 2,
    question: "நான் காரியங்களை மகிழ்வுடன் எதிர்நோக்கினேன்:",
    reverseScore: true,
    options: [
      "எப்போதும் செய்வது போல அந்த அளவுக்கு",
      "எப்போதும் செய்வதைவிட ஓரளவு குறைந்த அளவுக்கு",
      "எப்போதும் செய்வதைவிட நிச்சயமாகக் குறைந்த அளவுக்கு",
      "அரிதாக மட்டுமே"
    ]
  },

  {
    id: 3,
    question: "ஏதாவது தவறு நேர்ந்துவிட்டால் நான் என்னையே தேவையின்றிப் பழித்தேன்:",
    reverseScore: false,
    options: [
      "ஆம், பெரும்பாலான சமயங்களில்",
      "ஆம், சில நேரங்களில்",
      "அடிக்கடி அல்ல",
      "இல்லை, ஒருபோதும் இல்லை"
    ]
  },

  {
    id: 4,
    question: "தேவையில்லாத காரணத்திற்காக நான் பதற்றப்பட்டு அல்லது கவலைப்பட்டு இருந்துள்ளேன்:",
    reverseScore: true,
    options: [
      "இல்லை, இல்லவே இல்லை",
      "எப்போதாவது",
      "ஆம், சில நேரங்களில்",
      "ஆம், அடிக்கடி"
    ]
  },

  {
    id: 5,
    question: "ஒன்றுமே இல்லாத காரணத்திற்காக நான் பயந்துள்ளேன் அல்லது பீதியடைந்துள்ளேன்:",
    reverseScore: false,
    options: [
      "ஆம், நிறைய தடவை",
      "ஆம், சில நேரங்களில்",
      "இல்லை, அவ்வளவாக இல்லை",
      "இல்லை, எப்போதுமே இல்லை"
    ]
  },

  {
    id: 6,
    question: "என் மேல் அழுத்தம் அதிகரித்துள்ளது:",
    reverseScore: false,
    options: [
      "ஆம், பெரும்பாலான நேரங்களில் என்னால் சமாளிக்க முடியவில்லை",
      "ஆம், சில சமயங்களில் வழக்கம்போல் என்னால் சமாளிக்க முடியவில்லை",
      "இல்லை, பெரும்பாலான நேரங்களில் நான் நன்றாக சமாளித்து வந்துள்ளேன்",
      "இல்லை, நான் எப்போதும் போலவே சமாளித்துக் கொண்டு வந்துள்ளேன்"
    ]
  },

  {
    id: 7,
    question: "நான் மகிழ்ச்சியின்றி இருந்ததால் தூங்குவது கூட சிரமமாய் இருந்துள்ளது:",
    reverseScore: false,
    options: [
      "ஆம், பெரும்பாலான சமயங்களில்",
      "ஆம், சில நேரங்களில்",
      "இல்லை, அடிக்கடி அல்ல",
      "இல்லை, எப்போதுமே இல்லை"
    ]
  },

  {
    id: 8,
    question: "நான் துக்கமாக அல்லது பரிதாபகரமாக உணர்ந்துள்ளேன்:",
    reverseScore: false,
    options: [
      "ஆம், பெரும்பாலான சமயங்களில்",
      "ஆம், அடிக்கடி",
      "அடிக்கடி அல்ல",
      "இல்லை, எப்போதுமே இல்லை"
    ]
  },

  {
    id: 9,
    question: "நான் மகிழ்ச்சியின்றி இருந்ததால் அழுதுகொண்டே இருந்துள்ளேன்:",
    reverseScore: false,
    options: [
      "ஆம், பெரும்பாலான சமயங்களில்",
      "ஆம், அடிக்கடி",
      "எப்போதாவது மட்டும்",
      "இல்லை, ஒருபோதும் இல்லை"
    ]
  },

  {
    id: 10,
    question: "என்னை நானே காயப்படுத்திக் கொள்ளும் எண்ணம் எனக்கு ஏற்பட்டிருக்கிறது:",
    reverseScore: false,
    options: [
      "ஆம், அடிக்கடி",
      "சில சமயங்களில்",
      "எப்போதாவது",
      "ஒருபோதும் இல்லை"
    ]
  }
];
